UNFCOPY.саУНФУправлениеАссортиментом/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e557f2c9-6893-4523-9b13-07e678b2778a">
  <name>РасходнаяНакладная</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6dc7780f-7e2c-400d-a18b-888d94303ef2">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a2a715dc-bcd2-491e-872d-d5422c4eaf75">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fe6b9938-86b2-45ed-95b8-cc7399950548">
    <name>НомерСчетаНаОплату</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="92e239c7-d87f-4f90-be92-f0e01ce9340a">
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5fbc2a72-eea7-43e5-bc02-cb7b92a7a8de">
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06e1ced8-1604-4e0f-bf43-72ad120ee9fd">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1a823c75-83b9-4fec-a560-109ffb526f51">
    <name>Автомобиль</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФИОВодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="e89bf721-aa4c-49a8-aebb-7df31c82609e">
    <name>ПоложениеЗаказаПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВодительПосторонний</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/ПоложениеРеквизитаНаФорме/ПоложениеРеквизитаНаФорме.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b6ba242e-c1a1-4649-9b26-628f879af50f">
  <name>ПоложениеРеквизитаНаФорме</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="ce7ab997-f0e7-4ed7-9bcc-f1687660070a">
    <name>ВШапке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6f504531-be6d-4c6f-b234-c9c1d0688df4">
    <name>ВТабличнойЧасти</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/Documents/РасходнаяНакладная/ObjectModule.bsl
&После("ПриКопировании")
Процедура саУНФ_ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.ФИОВодителя = "";
	ЭтотОбъект.Водитель        =  Справочники.ФизическиеЛица.ПустаяСсылка();
КонецПроцедуры


&После("ПриЗаписи")
Процедура саУНФ_ПриЗаписи(Отказ)
	
КонецПроцедуры


&После("ПередЗаписью")
Процедура саУНФ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если  ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Если ЗначениеЗаполнено(Заказ.ПАК_МаршрутныйЛист) Тогда
			ЭтотОбъект.ФИОВодителя =  Заказ.ПАК_МаршрутныйЛист.ФиоВодителя;
			ЭтотОбъект.Водитель        =   Заказ.ПАК_МаршрутныйЛист.Курьер;
			
			Если НЕ ЗначениеЗаполнено(ПоложениеЗаказаПокупателя)
				ИЛИ ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти Тогда
				
				ПоложениеЗаказаПокупателя            = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
				
			КонецЕсли;
			
			
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры
